data/verification/convergence_2x/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
4000
(
(2.5e-05 2.5e-05 5e-06)
(7.5e-05 2.5e-05 5e-06)
(0.000125 2.5e-05 5e-06)
(0.000175 2.5e-05 5e-06)
(0.000225 2.5e-05 5e-06)
(0.000275 2.5e-05 5e-06)
(0.000325 2.5e-05 5e-06)
(0.000375 2.5e-05 5e-06)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(0 2.5e-05 5e-06)
(0 7.5e-05 5e-06)
(0 0.000125 5e-06)
(0 0.000175 5e-06)
(0 0.000225 5e-06)
(0 0.000275 5e-06)
(0 0.000325 5e-06)
(0 0.000375 5e-06)
(0 0.000425 5e-06)
(0 0.000475 5e-06)
(0 0.000525 5e-06)
(0 0.000575 5e-06)
(0 0.000625 5e-06)
(0 0.000675 5e-06)
(0 0.000725 5e-06)
(0 0.000775 5e-06)
(0 0.000825 5e-06)
(0 0.000875 5e-06)
(0 0.000925 5e-06)
(0 0.000975 5e-06)
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(0.01 2.5e-05 5e-06)
(0.01 7.5e-05 5e-06)
(0.01 0.000125 5e-06)
(0.01 0.000175 5e-06)
(0.01 0.000225 5e-06)
(0.01 0.000275 5e-06)
(0.01 0.000325 5e-06)
(0.01 0.000375 5e-06)
(0.01 0.000425 5e-06)
(0.01 0.000475 5e-06)
(0.01 0.000525 5e-06)
(0.01 0.000575 5e-06)
(0.01 0.000625 5e-06)
(0.01 0.000675 5e-06)
(0.01 0.000725 5e-06)
(0.01 0.000775 5e-06)
(0.01 0.000825 5e-06)
(0.01 0.000875 5e-06)
(0.01 0.000925 5e-06)
(0.01 0.000975 5e-06)
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(2.5e-05 0 5e-06)
(7.5e-05 0 5e-06)
(0.000125 0 5e-06)
(0.000175 0 5e-06)
(0.000225 0 5e-06)
(0.000275 0 5e-06)
(0.000325 0 5e-06)
(0.000375 0 5e-06)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
