data/verification/convergence_2x/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
4000
(
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
2.5e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
2.5e-05
7.5e-05
0.000125
0.000175
0.000225
0.000275
0.000325
0.000375
0.000425
0.000475
0.000525
0.000575
0.000625
0.000675
0.000725
0.000775
0.000825
0.000875
0.000925
0.000975
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
2.5e-05
7.5e-05
0.000125
0.000175
0.000225
0.000275
0.000325
0.000375
0.000425
0.000475
0.000525
0.000575
0.000625
0.000675
0.000725
0.000775
0.000825
0.000875
0.000925
0.000975
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
